[NoCoverage] BlockStatement
src/analiseDeDados.js:2:29
 class AnaliseDeDados {
-    constructor(dados = []) {
-      this.dados = dados; // Array numérico para análise estatística
-    }
+    constructor(dados = []) {}
   
     adicionarDados(novosDados) {

[NoCoverage] BlockStatement
src/analiseDeDados.js:6:32
       this.dados = dados; // Array numérico para análise estatística
     }
   
-    adicionarDados(novosDados) {
-      if (!Array.isArray(novosDados)) throw new Error("Os dados devem ser um array.");
-      this.dados.push(...novosDados);
-    }
+    adicionarDados(novosDados) {}
   
     limparDados() {

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:7:11
     }
   
     adicionarDados(novosDados) {
-      if (!Array.isArray(novosDados)) throw new Error("Os dados devem ser um array.");
+      if (false) throw new Error("Os dados devem ser um array.");
       this.dados.push(...novosDados);
     }

[NoCoverage] BooleanLiteral
src/analiseDeDados.js:7:11
     }
   
     adicionarDados(novosDados) {
-      if (!Array.isArray(novosDados)) throw new Error("Os dados devem ser um array.");
+      if (Array.isArray(novosDados)) throw new Error("Os dados devem ser um array.");
       this.dados.push(...novosDados);
     }

[NoCoverage] BlockStatement
src/analiseDeDados.js:11:19
       this.dados.push(...novosDados);
     }
   
-    limparDados() {
-      this.dados = [];
-    }
+    limparDados() {}
   
     ordenarDados() {

[NoCoverage] BlockStatement
src/analiseDeDados.js:15:20
       this.dados = [];
     }
   
-    ordenarDados() {
-      return [...this.dados].sort((a, b) => a - b);
-    }
+    ordenarDados() {}
   
     calcularMedia() {

[NoCoverage] MethodExpression
src/analiseDeDados.js:16:14
     }
   
     ordenarDados() {
-      return [...this.dados].sort((a, b) => a - b);
+      return [...this.dados];
     }
   

[NoCoverage] ArrowFunction
src/analiseDeDados.js:16:35
     }
   
     ordenarDados() {
-      return [...this.dados].sort((a, b) => a - b);
+      return [...this.dados].sort(() => undefined);
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:19:21
       return [...this.dados].sort((a, b) => a - b);
     }
   
-    calcularMedia() {
-      if (this.dados.length === 0) return null;
-      return this.dados.reduce((sum, num) => sum + num, 0) / this.dados.length;
-    }
+    calcularMedia() {}
   
     calcularMediana() {

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:20:11
     }
   
     calcularMedia() {
-      if (this.dados.length === 0) return null;
+      if (false) return null;
       return this.dados.reduce((sum, num) => sum + num, 0) / this.dados.length;
     }

[NoCoverage] EqualityOperator
src/analiseDeDados.js:20:11
     }
   
     calcularMedia() {
-      if (this.dados.length === 0) return null;
+      if (this.dados.length !== 0) return null;
       return this.dados.reduce((sum, num) => sum + num, 0) / this.dados.length;
     }

[NoCoverage] ArrowFunction
src/analiseDeDados.js:21:32
   
     calcularMedia() {
       if (this.dados.length === 0) return null;
-      return this.dados.reduce((sum, num) => sum + num, 0) / this.dados.length;
+      return this.dados.reduce(() => undefined, 0) / this.dados.length;
     }
   

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:21:46
   
     calcularMedia() {
       if (this.dados.length === 0) return null;
-      return this.dados.reduce((sum, num) => sum + num, 0) / this.dados.length;
+      return this.dados.reduce((sum, num) => sum - num, 0) / this.dados.length;
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:24:23
       return this.dados.reduce((sum, num) => sum + num, 0) / this.dados.length;
     }
   
-    calcularMediana() {
-      if (this.dados.length === 0) return null;
-      const ordenado = this.ordenarDados();
-      const meio = Math.floor(ordenado.length / 2);
-      return ordenado.length % 2 === 0 ? (ordenado[meio - 1] + ordenado[meio]) / 2 : ordenado[meio];
-    }
+    calcularMediana() {}
   
     calcularModa() {

[NoCoverage] EqualityOperator
src/analiseDeDados.js:25:11
     }
   
     calcularMediana() {
-      if (this.dados.length === 0) return null;
+      if (this.dados.length !== 0) return null;
       const ordenado = this.ordenarDados();
       const meio = Math.floor(ordenado.length / 2);

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:25:11
     }
   
     calcularMediana() {
-      if (this.dados.length === 0) return null;
+      if (false) return null;
       const ordenado = this.ordenarDados();
       const meio = Math.floor(ordenado.length / 2);

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:27:31
     calcularMediana() {
       if (this.dados.length === 0) return null;
       const ordenado = this.ordenarDados();
-      const meio = Math.floor(ordenado.length / 2);
+      const meio = Math.floor(ordenado.length * 2);
       return ordenado.length % 2 === 0 ? (ordenado[meio - 1] + ordenado[meio]) / 2 : ordenado[meio];
     }

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:28:14
       if (this.dados.length === 0) return null;
       const ordenado = this.ordenarDados();
       const meio = Math.floor(ordenado.length / 2);
-      return ordenado.length % 2 === 0 ? (ordenado[meio - 1] + ordenado[meio]) / 2 : ordenado[meio];
+      return false ? (ordenado[meio - 1] + ordenado[meio]) / 2 : ordenado[meio];
     }
   

[NoCoverage] EqualityOperator
src/analiseDeDados.js:28:14
       if (this.dados.length === 0) return null;
       const ordenado = this.ordenarDados();
       const meio = Math.floor(ordenado.length / 2);
-      return ordenado.length % 2 === 0 ? (ordenado[meio - 1] + ordenado[meio]) / 2 : ordenado[meio];
+      return ordenado.length % 2 !== 0 ? (ordenado[meio - 1] + ordenado[meio]) / 2 : ordenado[meio];
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:31:20
       return ordenado.length % 2 === 0 ? (ordenado[meio - 1] + ordenado[meio]) / 2 : ordenado[meio];
     }
   
-    calcularModa() {
-      if (this.dados.length === 0) return null;
-      const frequencias = this.dados.reduce((freq, num) => {
-        freq[num] = (freq[num] || 0) + 1;
-        return freq;
-      }, {});
-  
-      const maxFrequencia = Math.max(...Object.values(frequencias));
-      return Object.keys(frequencias)
-        .filter(num => frequencias[num] === maxFrequencia)
-        .map(Number);
-    }
+    calcularModa() {}
   
     calcularVariancia() {

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:32:11
     }
   
     calcularModa() {
-      if (this.dados.length === 0) return null;
+      if (true) return null;
       const frequencias = this.dados.reduce((freq, num) => {
         freq[num] = (freq[num] || 0) + 1;

[NoCoverage] EqualityOperator
src/analiseDeDados.js:32:11
     }
   
     calcularModa() {
-      if (this.dados.length === 0) return null;
+      if (this.dados.length !== 0) return null;
       const frequencias = this.dados.reduce((freq, num) => {
         freq[num] = (freq[num] || 0) + 1;

[NoCoverage] BlockStatement
src/analiseDeDados.js:33:60
   
     calcularModa() {
       if (this.dados.length === 0) return null;
-      const frequencias = this.dados.reduce((freq, num) => {
-        freq[num] = (freq[num] || 0) + 1;
-        return freq;
-      }, {});
+      const frequencias = this.dados.reduce((freq, num) => {}, {});
   
       const maxFrequencia = Math.max(...Object.values(frequencias));

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:34:22
     calcularModa() {
       if (this.dados.length === 0) return null;
       const frequencias = this.dados.reduce((freq, num) => {
-        freq[num] = (freq[num] || 0) + 1;
+        freq[num] = (true) + 1;
         return freq;
       }, {});

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:34:22
     calcularModa() {
       if (this.dados.length === 0) return null;
       const frequencias = this.dados.reduce((freq, num) => {
-        freq[num] = (freq[num] || 0) + 1;
+        freq[num] = (false) + 1;
         return freq;
       }, {});

[NoCoverage] MethodExpression
src/analiseDeDados.js:38:29
         return freq;
       }, {});
   
-      const maxFrequencia = Math.max(...Object.values(frequencias));
+      const maxFrequencia = Math.min(...Object.values(frequencias));
       return Object.keys(frequencias)
         .filter(num => frequencias[num] === maxFrequencia)

[NoCoverage] MethodExpression
src/analiseDeDados.js:39:14
       }, {});
   
       const maxFrequencia = Math.max(...Object.values(frequencias));
-      return Object.keys(frequencias)
-        .filter(num => frequencias[num] === maxFrequencia)
+      return Object.keys(frequencias)
         .map(Number);
     }

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:40:24
   
       const maxFrequencia = Math.max(...Object.values(frequencias));
       return Object.keys(frequencias)
-        .filter(num => frequencias[num] === maxFrequencia)
+        .filter(num => false)
         .map(Number);
     }

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:40:24
   
       const maxFrequencia = Math.max(...Object.values(frequencias));
       return Object.keys(frequencias)
-        .filter(num => frequencias[num] === maxFrequencia)
+        .filter(num => true)
         .map(Number);
     }

[NoCoverage] BlockStatement
src/analiseDeDados.js:44:25
         .map(Number);
     }
   
-    calcularVariancia() {
-      if (this.dados.length === 0) return null;
-      const media = this.calcularMedia();
-      return this.dados.reduce((sum, num) => sum + Math.pow(num - media, 2), 0) / this.dados.length;
-    }
+    calcularVariancia() {}
   
     calcularDesvioPadrao() {

[NoCoverage] EqualityOperator
src/analiseDeDados.js:45:11
     }
   
     calcularVariancia() {
-      if (this.dados.length === 0) return null;
+      if (this.dados.length !== 0) return null;
       const media = this.calcularMedia();
       return this.dados.reduce((sum, num) => sum + Math.pow(num - media, 2), 0) / this.dados.length;

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:45:11
     }
   
     calcularVariancia() {
-      if (this.dados.length === 0) return null;
+      if (false) return null;
       const media = this.calcularMedia();
       return this.dados.reduce((sum, num) => sum + Math.pow(num - media, 2), 0) / this.dados.length;

[NoCoverage] ArrowFunction
src/analiseDeDados.js:47:32
     calcularVariancia() {
       if (this.dados.length === 0) return null;
       const media = this.calcularMedia();
-      return this.dados.reduce((sum, num) => sum + Math.pow(num - media, 2), 0) / this.dados.length;
+      return this.dados.reduce(() => undefined, 0) / this.dados.length;
     }
   

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:47:46
     calcularVariancia() {
       if (this.dados.length === 0) return null;
       const media = this.calcularMedia();
-      return this.dados.reduce((sum, num) => sum + Math.pow(num - media, 2), 0) / this.dados.length;
+      return this.dados.reduce((sum, num) => sum - Math.pow(num - media, 2), 0) / this.dados.length;
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:50:28
       return this.dados.reduce((sum, num) => sum + Math.pow(num - media, 2), 0) / this.dados.length;
     }
   
-    calcularDesvioPadrao() {
-      const variancia = this.calcularVariancia();
-      return variancia !== null ? Math.sqrt(variancia) : null;
-    }
+    calcularDesvioPadrao() {}
   
     encontrarMinimo() {

[NoCoverage] EqualityOperator
src/analiseDeDados.js:52:14
   
     calcularDesvioPadrao() {
       const variancia = this.calcularVariancia();
-      return variancia !== null ? Math.sqrt(variancia) : null;
+      return variancia === null ? Math.sqrt(variancia) : null;
     }
   

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:52:14
   
     calcularDesvioPadrao() {
       const variancia = this.calcularVariancia();
-      return variancia !== null ? Math.sqrt(variancia) : null;
+      return false ? Math.sqrt(variancia) : null;
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:55:23
       return variancia !== null ? Math.sqrt(variancia) : null;
     }
   
-    encontrarMinimo() {
-      return this.dados.length ? Math.min(...this.dados) : null;
-    }
+    encontrarMinimo() {}
   
     encontrarMaximo() {

[NoCoverage] MethodExpression
src/analiseDeDados.js:56:34
     }
   
     encontrarMinimo() {
-      return this.dados.length ? Math.min(...this.dados) : null;
+      return this.dados.length ? Math.max(...this.dados) : null;
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:59:23
       return this.dados.length ? Math.min(...this.dados) : null;
     }
   
-    encontrarMaximo() {
-      return this.dados.length ? Math.max(...this.dados) : null;
-    }
+    encontrarMaximo() {}
   
     normalizarDados() {

[NoCoverage] MethodExpression
src/analiseDeDados.js:60:34
     }
   
     encontrarMaximo() {
-      return this.dados.length ? Math.max(...this.dados) : null;
+      return this.dados.length ? Math.min(...this.dados) : null;
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:63:23
       return this.dados.length ? Math.max(...this.dados) : null;
     }
   
-    normalizarDados() {
-      const min = this.encontrarMinimo();
-      const max = this.encontrarMaximo();
-      if (min === max) return this.dados.map(() => 0);
-      return this.dados.map(num => (num - min) / (max - min));
-    }
+    normalizarDados() {}
   
     calcularPercentil(percentil) {

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:66:11
     normalizarDados() {
       const min = this.encontrarMinimo();
       const max = this.encontrarMaximo();
-      if (min === max) return this.dados.map(() => 0);
+      if (true) return this.dados.map(() => 0);
       return this.dados.map(num => (num - min) / (max - min));
     }

[NoCoverage] ArrowFunction
src/analiseDeDados.js:66:46
     normalizarDados() {
       const min = this.encontrarMinimo();
       const max = this.encontrarMaximo();
-      if (min === max) return this.dados.map(() => 0);
+      if (min === max) return this.dados.map(() => undefined);
       return this.dados.map(num => (num - min) / (max - min));
     }

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:67:36
       const min = this.encontrarMinimo();
       const max = this.encontrarMaximo();
       if (min === max) return this.dados.map(() => 0);
-      return this.dados.map(num => (num - min) / (max - min));
+      return this.dados.map(num => (num - min) * (max - min));
     }
   

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:67:51
       const min = this.encontrarMinimo();
       const max = this.encontrarMaximo();
       if (min === max) return this.dados.map(() => 0);
-      return this.dados.map(num => (num - min) / (max - min));
+      return this.dados.map(num => (num - min) / (max + min));
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:70:34
       return this.dados.map(num => (num - min) / (max - min));
     }
   
-    calcularPercentil(percentil) {
-      if (this.dados.length === 0 || percentil < 0 || percentil > 100) return null;
-      const ordenado = this.ordenarDados();
-      const index = (percentil / 100) * (ordenado.length - 1);
-      const base = Math.floor(index);
-      const resto = index - base;
-      return resto > 0 ? ordenado[base] + resto * (ordenado[base + 1] - ordenado[base]) : ordenado[base];
-    }
+    calcularPercentil(percentil) {}
   
     calcularSoma() {

[NoCoverage] EqualityOperator
src/analiseDeDados.js:71:38
     }
   
     calcularPercentil(percentil) {
-      if (this.dados.length === 0 || percentil < 0 || percentil > 100) return null;
+      if (this.dados.length === 0 || percentil <= 0 || percentil > 100) return null;
       const ordenado = this.ordenarDados();
       const index = (percentil / 100) * (ordenado.length - 1);

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:71:11
     }
   
     calcularPercentil(percentil) {
-      if (this.dados.length === 0 || percentil < 0 || percentil > 100) return null;
+      if (false) return null;
       const ordenado = this.ordenarDados();
       const index = (percentil / 100) * (ordenado.length - 1);

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:73:42
     calcularPercentil(percentil) {
       if (this.dados.length === 0 || percentil < 0 || percentil > 100) return null;
       const ordenado = this.ordenarDados();
-      const index = (percentil / 100) * (ordenado.length - 1);
+      const index = (percentil / 100) * (ordenado.length + 1);
       const base = Math.floor(index);
       const resto = index - base;

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:73:21
     calcularPercentil(percentil) {
       if (this.dados.length === 0 || percentil < 0 || percentil > 100) return null;
       const ordenado = this.ordenarDados();
-      const index = (percentil / 100) * (ordenado.length - 1);
+      const index = percentil / 100 / (ordenado.length - 1);
       const base = Math.floor(index);
       const resto = index - base;

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:75:21
       const ordenado = this.ordenarDados();
       const index = (percentil / 100) * (ordenado.length - 1);
       const base = Math.floor(index);
-      const resto = index - base;
+      const resto = index + base;
       return resto > 0 ? ordenado[base] + resto * (ordenado[base + 1] - ordenado[base]) : ordenado[base];
     }

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:76:52
       const index = (percentil / 100) * (ordenado.length - 1);
       const base = Math.floor(index);
       const resto = index - base;
-      return resto > 0 ? ordenado[base] + resto * (ordenado[base + 1] - ordenado[base]) : ordenado[base];
+      return resto > 0 ? ordenado[base] + resto * (ordenado[base + 1] + ordenado[base]) : ordenado[base];
     }
   

[NoCoverage] EqualityOperator
src/analiseDeDados.js:76:14
       const index = (percentil / 100) * (ordenado.length - 1);
       const base = Math.floor(index);
       const resto = index - base;
-      return resto > 0 ? ordenado[base] + resto * (ordenado[base + 1] - ordenado[base]) : ordenado[base];
+      return resto <= 0 ? ordenado[base] + resto * (ordenado[base + 1] - ordenado[base]) : ordenado[base];
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:79:20
       return resto > 0 ? ordenado[base] + resto * (ordenado[base + 1] - ordenado[base]) : ordenado[base];
     }
   
-    calcularSoma() {
-      return this.dados.reduce((sum, num) => sum + num, 0);
-    }
+    calcularSoma() {}
   
     calcularProduto() {

[NoCoverage] ArrowFunction
src/analiseDeDados.js:80:32
     }
   
     calcularSoma() {
-      return this.dados.reduce((sum, num) => sum + num, 0);
+      return this.dados.reduce(() => undefined, 0);
     }
   

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:80:46
     }
   
     calcularSoma() {
-      return this.dados.reduce((sum, num) => sum + num, 0);
+      return this.dados.reduce((sum, num) => sum - num, 0);
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:83:23
       return this.dados.reduce((sum, num) => sum + num, 0);
     }
   
-    calcularProduto() {
-      return this.dados.reduce((prod, num) => prod * num, 1);
-    }
+    calcularProduto() {}
   
     calcularAmplitude() {

[NoCoverage] ArrowFunction
src/analiseDeDados.js:84:32
     }
   
     calcularProduto() {
-      return this.dados.reduce((prod, num) => prod * num, 1);
+      return this.dados.reduce(() => undefined, 1);
     }
   

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:84:47
     }
   
     calcularProduto() {
-      return this.dados.reduce((prod, num) => prod * num, 1);
+      return this.dados.reduce((prod, num) => prod / num, 1);
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:87:25
       return this.dados.reduce((prod, num) => prod * num, 1);
     }
   
-    calcularAmplitude() {
-      return this.encontrarMaximo() - this.encontrarMinimo();
-    }
+    calcularAmplitude() {}
   
     calcularCoeficienteVariacao() {

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:88:14
     }
   
     calcularAmplitude() {
-      return this.encontrarMaximo() - this.encontrarMinimo();
+      return this.encontrarMaximo() + this.encontrarMinimo();
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:91:35
       return this.encontrarMaximo() - this.encontrarMinimo();
     }
   
-    calcularCoeficienteVariacao() {
-      const media = this.calcularMedia();
-      const desvio = this.calcularDesvioPadrao();
-      return media !== 0 ? (desvio / media) * 100 : null;
-    }
+    calcularCoeficienteVariacao() {}
   
     removerOutliers(fator = 1.5) {

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:94:14
     calcularCoeficienteVariacao() {
       const media = this.calcularMedia();
       const desvio = this.calcularDesvioPadrao();
-      return media !== 0 ? (desvio / media) * 100 : null;
+      return true ? (desvio / media) * 100 : null;
     }
   

[NoCoverage] EqualityOperator
src/analiseDeDados.js:94:14
     calcularCoeficienteVariacao() {
       const media = this.calcularMedia();
       const desvio = this.calcularDesvioPadrao();
-      return media !== 0 ? (desvio / media) * 100 : null;
+      return media === 0 ? (desvio / media) * 100 : null;
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:97:34
       return media !== 0 ? (desvio / media) * 100 : null;
     }
   
-    removerOutliers(fator = 1.5) {
-      const q1 = this.calcularPercentil(25);
-      const q3 = this.calcularPercentil(75);
-      const iqr = q3 - q1;
-      const limiteInferior = q1 - fator * iqr;
-      const limiteSuperior = q3 + fator * iqr;
-      this.dados = this.dados.filter(num => num >= limiteInferior && num <= limiteSuperior);
-    }
+    removerOutliers(fator = 1.5) {}
   
     calcularCorrelacao(outroConjunto) {

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:100:19
     removerOutliers(fator = 1.5) {
       const q1 = this.calcularPercentil(25);
       const q3 = this.calcularPercentil(75);
-      const iqr = q3 - q1;
+      const iqr = q3 + q1;
       const limiteInferior = q1 - fator * iqr;
       const limiteSuperior = q3 + fator * iqr;

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:101:30
       const q1 = this.calcularPercentil(25);
       const q3 = this.calcularPercentil(75);
       const iqr = q3 - q1;
-      const limiteInferior = q1 - fator * iqr;
+      const limiteInferior = q1 + fator * iqr;
       const limiteSuperior = q3 + fator * iqr;
       this.dados = this.dados.filter(num => num >= limiteInferior && num <= limiteSuperior);

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:101:35
       const q1 = this.calcularPercentil(25);
       const q3 = this.calcularPercentil(75);
       const iqr = q3 - q1;
-      const limiteInferior = q1 - fator * iqr;
+      const limiteInferior = q1 - fator / iqr;
       const limiteSuperior = q3 + fator * iqr;
       this.dados = this.dados.filter(num => num >= limiteInferior && num <= limiteSuperior);

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:102:30
       const q3 = this.calcularPercentil(75);
       const iqr = q3 - q1;
       const limiteInferior = q1 - fator * iqr;
-      const limiteSuperior = q3 + fator * iqr;
+      const limiteSuperior = q3 - fator * iqr;
       this.dados = this.dados.filter(num => num >= limiteInferior && num <= limiteSuperior);
     }

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:102:35
       const q3 = this.calcularPercentil(75);
       const iqr = q3 - q1;
       const limiteInferior = q1 - fator * iqr;
-      const limiteSuperior = q3 + fator * iqr;
+      const limiteSuperior = q3 + fator / iqr;
       this.dados = this.dados.filter(num => num >= limiteInferior && num <= limiteSuperior);
     }

[NoCoverage] EqualityOperator
src/analiseDeDados.js:103:45
       const iqr = q3 - q1;
       const limiteInferior = q1 - fator * iqr;
       const limiteSuperior = q3 + fator * iqr;
-      this.dados = this.dados.filter(num => num >= limiteInferior && num <= limiteSuperior);
+      this.dados = this.dados.filter(num => num < limiteInferior && num <= limiteSuperior);
     }
   

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:103:70
       const iqr = q3 - q1;
       const limiteInferior = q1 - fator * iqr;
       const limiteSuperior = q3 + fator * iqr;
-      this.dados = this.dados.filter(num => num >= limiteInferior && num <= limiteSuperior);
+      this.dados = this.dados.filter(num => num >= limiteInferior && true);
     }
   

[NoCoverage] BlockStatement
src/analiseDeDados.js:106:39
       this.dados = this.dados.filter(num => num >= limiteInferior && num <= limiteSuperior);
     }
   
-    calcularCorrelacao(outroConjunto) {
-      if (!Array.isArray(outroConjunto) || this.dados.length !== outroConjunto.length) return null;
-      
-      const mediaX = this.calcularMedia();
-      const mediaY = outroConjunto.reduce((sum, num) => sum + num, 0) / outroConjunto.length;
-  
-      const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] - mediaY), 0);
-      const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
-      const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));
-  
-      return denominadorX * denominadorY !== 0 ? numerador / (denominadorX * denominadorY) : null;
-    }
+    calcularCorrelacao(outroConjunto) {}
   }
 

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:107:11
     }
   
     calcularCorrelacao(outroConjunto) {
-      if (!Array.isArray(outroConjunto) || this.dados.length !== outroConjunto.length) return null;
+      if (true) return null;
       
       const mediaX = this.calcularMedia();

[NoCoverage] BooleanLiteral
src/analiseDeDados.js:107:11
     }
   
     calcularCorrelacao(outroConjunto) {
-      if (!Array.isArray(outroConjunto) || this.dados.length !== outroConjunto.length) return null;
+      if (Array.isArray(outroConjunto) || this.dados.length !== outroConjunto.length) return null;
       
       const mediaX = this.calcularMedia();

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:110:57
       if (!Array.isArray(outroConjunto) || this.dados.length !== outroConjunto.length) return null;
       
       const mediaX = this.calcularMedia();
-      const mediaY = outroConjunto.reduce((sum, num) => sum + num, 0) / outroConjunto.length;
+      const mediaY = outroConjunto.reduce((sum, num) => sum - num, 0) / outroConjunto.length;
   
       const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] - mediaY), 0);

[NoCoverage] ArrowFunction
src/analiseDeDados.js:110:43
       if (!Array.isArray(outroConjunto) || this.dados.length !== outroConjunto.length) return null;
       
       const mediaX = this.calcularMedia();
-      const mediaY = outroConjunto.reduce((sum, num) => sum + num, 0) / outroConjunto.length;
+      const mediaY = outroConjunto.reduce(() => undefined, 0) / outroConjunto.length;
   
       const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] - mediaY), 0);

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:112:80
       const mediaX = this.calcularMedia();
       const mediaY = outroConjunto.reduce((sum, num) => sum + num, 0) / outroConjunto.length;
   
-      const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] - mediaY), 0);
+      const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] + mediaY), 0);
       const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
       const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:112:64
       const mediaX = this.calcularMedia();
       const mediaY = outroConjunto.reduce((sum, num) => sum + num, 0) / outroConjunto.length;
   
-      const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] - mediaY), 0);
+      const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) / (outroConjunto[i] - mediaY), 0);
       const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
       const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:113:83
       const mediaY = outroConjunto.reduce((sum, num) => sum + num, 0) / outroConjunto.length;
   
       const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] - mediaY), 0);
-      const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
+      const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x + mediaX, 2), 0));
       const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));
   

[NoCoverage] ArrowFunction
src/analiseDeDados.js:113:56
       const mediaY = outroConjunto.reduce((sum, num) => sum + num, 0) / outroConjunto.length;
   
       const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] - mediaY), 0);
-      const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
+      const denominadorX = Math.sqrt(this.dados.reduce(() => undefined, 0));
       const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));
   
