[NoCoverage] ArrowFunction
src/analiseDeDados.js:114:59
   
       const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] - mediaY), 0);
       const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
-      const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));
+      const denominadorY = Math.sqrt(outroConjunto.reduce(() => undefined, 0));
   
       return denominadorX * denominadorY !== 0 ? numerador / (denominadorX * denominadorY) : null;

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:114:71
   
       const numerador = this.dados.reduce((sum, x, i) => sum + (x - mediaX) * (outroConjunto[i] - mediaY), 0);
       const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
-      const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));
+      const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum - Math.pow(y - mediaY, 2), 0));
   
       return denominadorX * denominadorY !== 0 ? numerador / (denominadorX * denominadorY) : null;

[NoCoverage] ConditionalExpression
src/analiseDeDados.js:116:14
       const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
       const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));
   
-      return denominadorX * denominadorY !== 0 ? numerador / (denominadorX * denominadorY) : null;
+      return true ? numerador / (denominadorX * denominadorY) : null;
     }
   }

[NoCoverage] ArithmeticOperator
src/analiseDeDados.js:116:50
       const denominadorX = Math.sqrt(this.dados.reduce((sum, x) => sum + Math.pow(x - mediaX, 2), 0));
       const denominadorY = Math.sqrt(outroConjunto.reduce((sum, y) => sum + Math.pow(y - mediaY, 2), 0));
   
-      return denominadorX * denominadorY !== 0 ? numerador / (denominadorX * denominadorY) : null;
+      return denominadorX * denominadorY !== 0 ? numerador * (denominadorX * denominadorY) : null;
     }
   }
