[Killed] BlockStatement
src/anagram.js:1:35
-const isAnagram = (str1, str2) => {
-  return formatStr(str1) === formatStr(str2);
-};
+const isAnagram = (str1, str2) => {};
 
 function formatStr(str) {
killedBy: Validando anagrama válido
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/anagram.js:2:10
 const isAnagram = (str1, str2) => {
-  return formatStr(str1) === formatStr(str2);
+  return true;
 };
 
killedBy: Validando anagrama inválido
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] EqualityOperator
src/anagram.js:2:10
 const isAnagram = (str1, str2) => {
-  return formatStr(str1) === formatStr(str2);
+  return formatStr(str1) !== formatStr(str2);
 };
 
killedBy: Validando anagrama válido
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/anagram.js:5:25
   return formatStr(str1) === formatStr(str2);
 };
 
-function formatStr(str) {
-  return str.replace(/[^\w]/g, "").toLowerCase().split("").sort().join("");
-}
+function formatStr(str) {}
 
 module.exports = {
killedBy: Validando anagrama inválido
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] MethodExpression
src/anagram.js:6:10
 };
 
 function formatStr(str) {
-  return str.replace(/[^\w]/g, "").toLowerCase().split("").sort().join("");
+  return str.replace(/[^\w]/g, "").toLowerCase().split("").join("");
 }
 
killedBy: Validando anagrama válido
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] MethodExpression
src/anagram.js:6:10
 };
 
 function formatStr(str) {
-  return str.replace(/[^\w]/g, "").toLowerCase().split("").sort().join("");
+  return str.replace(/[^\w]/g, "").toUpperCase().split("").sort().join("");
 }
 

[Killed] ObjectLiteral
src/anagram.js:9:18
   return str.replace(/[^\w]/g, "").toLowerCase().split("").sort().join("");
 }
 
-module.exports = {
-  isAnagram,
-};
+module.exports = {};
 
killedBy: Validando anagrama válido
statusReason: TypeError: isAnagram is not a function
