[Killed] BlockStatement
src/banco.js:2:41
 class Banco {
-    constructor(nome, saldoInicial = 0) {
-        this.nome = nome;
-        this.saldo = saldoInicial;
-        this.transacoes = [];
-    }
+    constructor(nome, saldoInicial = 0) {}
 
     // Método 1: Depositar dinheiro
killedBy: Classe Banco - Método depositar Depositar o valor alterando o saldo corretamente
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
src/banco.js:5:27
     constructor(nome, saldoInicial = 0) {
         this.nome = nome;
         this.saldo = saldoInicial;
-        this.transacoes = [];
+        this.transacoes = ["Stryker was here"];
     }
 
killedBy: Classe Banco - Método depositar Adicionar o depósito na lista de transações
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  ["Stryker was here", {"tipo": "Depósito", "valor": 50}]

[Killed] BlockStatement
src/banco.js:9:22
     }
 
     // Método 1: Depositar dinheiro
-    depositar(valor) {
-        this.saldo += valor;
-        this.transacoes.push({ tipo: 'Depósito', valor });
-        return this.saldo;
-    }
+    depositar(valor) {}
 
     // Método 2: Sacar dinheiro
killedBy: Classe Banco - Método depositar Depositar o valor alterando o saldo corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: undefined

[Killed] AssignmentOperator
src/banco.js:10:9
 
     // Método 1: Depositar dinheiro
     depositar(valor) {
-        this.saldo += valor;
+        this.saldo -= valor;
         this.transacoes.push({ tipo: 'Depósito', valor });
         return this.saldo;
killedBy: Classe Banco - Método depositar Depositar o valor alterando o saldo corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] BlockStatement
src/banco.js:16:18
     }
 
     // Método 2: Sacar dinheiro
-    sacar(valor) {
-        if (valor > this.saldo) {
-            throw new Error('Saldo insuficiente');
-        }
-        this.saldo -= valor;
-        this.transacoes.push({ tipo: 'Saque', valor });
-        return this.saldo;
-    }
+    sacar(valor) {}
 
     // Método 3: Transferir dinheiro para outra conta
killedBy: Classe Banco - Método sacar Deve lançar um erro ao tentar sacar acima do limite
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Saldo insuficiente"

Received function did not throw

[Killed] EqualityOperator
src/banco.js:17:13
 
     // Método 2: Sacar dinheiro
     sacar(valor) {
-        if (valor > this.saldo) {
+        if (valor <= this.saldo) {
             throw new Error('Saldo insuficiente');
         }
killedBy: Classe Banco - Método sacar Deve lançar um erro ao tentar sacar acima do limite
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Saldo insuficiente"

Received function did not throw

[Killed] BlockStatement
src/banco.js:17:33
 
     // Método 2: Sacar dinheiro
     sacar(valor) {
-        if (valor > this.saldo) {
-            throw new Error('Saldo insuficiente');
-        }
+        if (valor > this.saldo) {}
         this.saldo -= valor;
         this.transacoes.push({ tipo: 'Saque', valor });
killedBy: Classe Banco - Método sacar Deve lançar um erro ao tentar sacar acima do limite
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Saldo insuficiente"

Received function did not throw

[Killed] AssignmentOperator
src/banco.js:20:9
         if (valor > this.saldo) {
             throw new Error('Saldo insuficiente');
         }
-        this.saldo -= valor;
+        this.saldo += valor;
         this.transacoes.push({ tipo: 'Saque', valor });
         return this.saldo;
killedBy: Classe Banco - Método sacar Sacar valor válido e atualizar o saldo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 70

[Killed] BlockStatement
src/banco.js:26:37
     }
 
     // Método 3: Transferir dinheiro para outra conta
-    transferir(valor, contaDestino) {
-        this.sacar(valor);
-        contaDestino.depositar(valor);
-        this.transacoes.push({ tipo: 'Transferência', valor, destino: contaDestino.nome });
-    }
+    transferir(valor, contaDestino) {}
 
     // Método 4: Obter saldo atual
killedBy: Classe Banco - Método transferir Transferir dinheiro para outra conta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 40
Received: 50

[Survived] StringLiteral
src/banco.js:29:38
     transferir(valor, contaDestino) {
         this.sacar(valor);
         contaDestino.depositar(valor);
-        this.transacoes.push({ tipo: 'Transferência', valor, destino: contaDestino.nome });
+        this.transacoes.push({ tipo: "", valor, destino: contaDestino.nome });
     }
 

[Killed] BlockStatement
src/banco.js:33:18
     }
 
     // Método 4: Obter saldo atual
-    obterSaldo() {
-        return this.saldo;
-    }
+    obterSaldo() {}
 
     // Método 5: Obter histórico de transações
killedBy: Classe Banco - Método obterSaldo Obter saldo atual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: undefined

[Killed] BlockStatement
src/banco.js:38:22
     }
 
     // Método 5: Obter histórico de transações
-    obterHistorico() {
-        return this.transacoes;
-    }
+    obterHistorico() {}
 
     // Método 6: Definir limite de saque
killedBy: Classe Banco - Método obterHistorico Obter lista de transações
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/banco.js:43:39
     }
 
     // Método 6: Definir limite de saque
-    definirLimiteDeSaque(valorLimite) {
-        this.limiteDeSaque = valorLimite;
-    }
+    definirLimiteDeSaque(valorLimite) {}
 
     // Método 7: Verificar se saque está dentro do limite
killedBy: Classe Banco - Método definirLimiteDeSaque Definir limite de saque
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: undefined

[Killed] BlockStatement
src/banco.js:48:35
     }
 
     // Método 7: Verificar se saque está dentro do limite
-    verificarLimiteDeSaque(valor) {
-        if (valor > this.limiteDeSaque) {
-            throw new Error('Saque acima do limite permitido');
-        }
-        return true;
-    }
+    verificarLimiteDeSaque(valor) {}
 
     // Método 8: Aplicar juros ao saldo
killedBy: Classe Banco - Método verificarLimiteDeSaque Deve permitir saque dentro do limite
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/banco.js:49:13
 
     // Método 7: Verificar se saque está dentro do limite
     verificarLimiteDeSaque(valor) {
-        if (valor > this.limiteDeSaque) {
+        if (valor <= this.limiteDeSaque) {
             throw new Error('Saque acima do limite permitido');
         }
killedBy: Classe Banco - Método verificarLimiteDeSaque Deve permitir saque dentro do limite
statusReason: Error: Saque acima do limite permitido

[Killed] ConditionalExpression
src/banco.js:49:13
 
     // Método 7: Verificar se saque está dentro do limite
     verificarLimiteDeSaque(valor) {
-        if (valor > this.limiteDeSaque) {
+        if (true) {
             throw new Error('Saque acima do limite permitido');
         }
killedBy: Classe Banco - Método verificarLimiteDeSaque Deve permitir saque dentro do limite
statusReason: Error: Saque acima do limite permitido

[Killed] StringLiteral
src/banco.js:50:29
     // Método 7: Verificar se saque está dentro do limite
     verificarLimiteDeSaque(valor) {
         if (valor > this.limiteDeSaque) {
-            throw new Error('Saque acima do limite permitido');
+            throw new Error("");
         }
         return true;
killedBy: Classe Banco - Método verificarLimiteDeSaque Deve lançar um erro ao verificar que o saldo está acima do limite
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Saque acima do limite permitido"
Received message:   ""

      153 |         } else {
      154 |           stryCov_9fa48("197");
    > 155 |           throw new Error(stryMutAct_9fa48("198") ? "" : (stryCov_9fa48("198"), 'Saque acima do limite permitido'));

[Killed] BlockStatement
src/banco.js:56:24
     }
 
     // Método 8: Aplicar juros ao saldo
-    aplicarJuros(taxa) {
-        const juros = this.saldo * (taxa / 100);
-        this.saldo += juros;
-        this.transacoes.push({ tipo: 'Juros', valor: juros });
-        return this.saldo;
-    }
+    aplicarJuros(taxa) {}
 
     // Método 9: Pagar uma conta
killedBy: Classe Banco - Método aplicarJuros Aplicar juros ao saldo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 550
Received: 500

[Killed] ArithmeticOperator
src/banco.js:57:23
 
     // Método 8: Aplicar juros ao saldo
     aplicarJuros(taxa) {
-        const juros = this.saldo * (taxa / 100);
+        const juros = this.saldo / (taxa / 100);
         this.saldo += juros;
         this.transacoes.push({ tipo: 'Juros', valor: juros });
killedBy: Classe Banco - Método aplicarJuros Aplicar juros ao saldo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 550
Received: 5500

[Killed] ArithmeticOperator
src/banco.js:57:37
 
     // Método 8: Aplicar juros ao saldo
     aplicarJuros(taxa) {
-        const juros = this.saldo * (taxa / 100);
+        const juros = this.saldo * (taxa * 100);
         this.saldo += juros;
         this.transacoes.push({ tipo: 'Juros', valor: juros });
killedBy: Classe Banco - Método aplicarJuros Aplicar juros ao saldo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 550
Received: 500500

[Killed] AssignmentOperator
src/banco.js:58:9
     // Método 8: Aplicar juros ao saldo
     aplicarJuros(taxa) {
         const juros = this.saldo * (taxa / 100);
-        this.saldo += juros;
+        this.saldo -= juros;
         this.transacoes.push({ tipo: 'Juros', valor: juros });
         return this.saldo;
killedBy: Classe Banco - Método aplicarJuros Aplicar juros ao saldo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 550
Received: 450

[Killed] BlockStatement
src/banco.js:64:34
     }
 
     // Método 9: Pagar uma conta
-    pagarConta(valor, descricao) {
-        this.sacar(valor);
-        this.transacoes.push({ tipo: 'Pagamento', valor, descricao });
-        return this.saldo;
-    }
+    pagarConta(valor, descricao) {}
 
     // Método 10: Obter o total depositado
killedBy: Classe Banco - Método pagarConta Adicionar pagamento à lista de transações
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] ObjectLiteral
src/banco.js:66:30
     // Método 9: Pagar uma conta
     pagarConta(valor, descricao) {
         this.sacar(valor);
-        this.transacoes.push({ tipo: 'Pagamento', valor, descricao });
+        this.transacoes.push({});
         return this.saldo;
     }
killedBy: Classe Banco - Método pagarConta Adicionar pagamento à lista de transações
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "descricao": "Fatura",
-   "tipo": "Pagamento",

[Killed] BlockStatement
src/banco.js:71:28
     }
 
     // Método 10: Obter o total depositado
-    obterTotalDepositado() {
-        return this.transacoes
-            .filter(transacao => transacao.tipo === 'Depósito')
-            .reduce((total, transacao) => total + transacao.valor, 0);
-    }
+    obterTotalDepositado() {}
 }
 
killedBy: Classe Banco - Método obterTotalDepositado Obter o total depositado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: undefined

[Survived] MethodExpression
src/banco.js:72:16
 
     // Método 10: Obter o total depositado
     obterTotalDepositado() {
-        return this.transacoes
-            .filter(transacao => transacao.tipo === 'Depósito')
+        return this.transacoes
             .reduce((total, transacao) => total + transacao.valor, 0);
     }

[Killed] ArrowFunction
src/banco.js:73:21
     // Método 10: Obter o total depositado
     obterTotalDepositado() {
         return this.transacoes
-            .filter(transacao => transacao.tipo === 'Depósito')
+            .filter(() => undefined)
             .reduce((total, transacao) => total + transacao.valor, 0);
     }
killedBy: Classe Banco - Método obterTotalDepositado Obter o total depositado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 0

[Killed] ConditionalExpression
src/banco.js:73:34
     // Método 10: Obter o total depositado
     obterTotalDepositado() {
         return this.transacoes
-            .filter(transacao => transacao.tipo === 'Depósito')
+            .filter(transacao => false)
             .reduce((total, transacao) => total + transacao.valor, 0);
     }
killedBy: Classe Banco - Método obterTotalDepositado Obter o total depositado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 0

[Killed] ArithmeticOperator
src/banco.js:74:43
     obterTotalDepositado() {
         return this.transacoes
             .filter(transacao => transacao.tipo === 'Depósito')
-            .reduce((total, transacao) => total + transacao.valor, 0);
+            .reduce((total, transacao) => total - transacao.valor, 0);
     }
 }
killedBy: Classe Banco - Método obterTotalDepositado Obter o total depositado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: -55

[Killed] ArrowFunction
src/banco.js:74:21
     obterTotalDepositado() {
         return this.transacoes
             .filter(transacao => transacao.tipo === 'Depósito')
-            .reduce((total, transacao) => total + transacao.valor, 0);
+            .reduce(() => undefined, 0);
     }
 }
killedBy: Classe Banco - Método obterTotalDepositado Obter o total depositado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: undefined
