[Killed] BlockStatement
src/calculator.js:1:25
-const somar = (a, b) => {
-  return a + b;
-};
+const somar = (a, b) => {};
 
 const diminuir = (a, b) => {
killedBy: Somar dois valores válidos
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 15
Received: undefined

[Killed] ArithmeticOperator
src/calculator.js:2:10
 const somar = (a, b) => {
-  return a + b;
+  return a - b;
 };
 
killedBy: Somar dois valores válidos
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 15
Received: -5

[Killed] BlockStatement
src/calculator.js:5:28
   return a + b;
 };
 
-const diminuir = (a, b) => {
-  return a - b;
-};
+const diminuir = (a, b) => {};
 
 const multiplicar = (a, b) => {
killedBy: Diminuir dois valores válidos
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 10
Received: undefined

[Killed] ArithmeticOperator
src/calculator.js:6:10
 };
 
 const diminuir = (a, b) => {
-  return a - b;
+  return a + b;
 };
 
killedBy: Diminuir dois valores válidos
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 10
Received: 30

[Killed] BlockStatement
src/calculator.js:9:31
   return a - b;
 };
 
-const multiplicar = (a, b) => {
-  return a * b;
-};
+const multiplicar = (a, b) => {};
 
 const dividir = (a, b) => {
killedBy: Multiplicar dois valores válidos
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 50
Received: undefined

[Killed] ArithmeticOperator
src/calculator.js:10:10
 };
 
 const multiplicar = (a, b) => {
-  return a * b;
+  return a / b;
 };
 
killedBy: Multiplicar dois valores válidos
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 50
Received: 0.5

[Killed] BlockStatement
src/calculator.js:13:27
   return a * b;
 };
 
-const dividir = (a, b) => {
-  return a / b;
-};
+const dividir = (a, b) => {};
 
 module.exports = {
killedBy: Dividir dois valores válidos
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
src/calculator.js:14:10
 };
 
 const dividir = (a, b) => {
-  return a / b;
+  return a * b;
 };
 
killedBy: Dividir dois valores válidos
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 200

[Killed] ObjectLiteral
src/calculator.js:17:18
   return a / b;
 };
 
-module.exports = {
-  somar,
-  diminuir,
-  multiplicar,
-  dividir,
-};
+module.exports = {};
 
killedBy: Somar dois valores válidos
statusReason: TypeError: somar is not a function
