[Killed] BlockStatement
src/carro.js:2:37
 class Carro {
-    constructor(marca, modelo, ano) {
-        this.marca = marca;
-        this.modelo = modelo;
-        this.ano = ano;
-        this.kilometragem = 0;
-    }
+    constructor(marca, modelo, ano) {}
 
     dirigir(distancia) {
killedBy: Testes da classe Carro Deve criar um carro com a marca, modelo e ano corretos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Toyota"
Received: undefined

[Killed] BlockStatement
src/carro.js:9:24
         this.kilometragem = 0;
     }
 
-    dirigir(distancia) {
-        if (distancia > 0) {
-            this.kilometragem += distancia;
-        }
-    }
+    dirigir(distancia) {}
 
     obterInfo() {
killedBy: Testes da classe Carro Deve dirigir o carro e aumentar a quilometragem corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] ConditionalExpression
src/carro.js:10:13
     }
 
     dirigir(distancia) {
-        if (distancia > 0) {
+        if (true) {
             this.kilometragem += distancia;
         }
killedBy: Testes da classe Carro Não deve alterar a quilometragem se a distância for negativa
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -50

[Killed] ConditionalExpression
src/carro.js:10:13
     }
 
     dirigir(distancia) {
-        if (distancia > 0) {
+        if (false) {
             this.kilometragem += distancia;
         }
killedBy: Testes da classe Carro Deve dirigir o carro e aumentar a quilometragem corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] AssignmentOperator
src/carro.js:11:13
 
     dirigir(distancia) {
         if (distancia > 0) {
-            this.kilometragem += distancia;
+            this.kilometragem -= distancia;
         }
     }
killedBy: Testes da classe Carro Deve dirigir o carro e aumentar a quilometragem corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: -100

[Killed] BlockStatement
src/carro.js:15:17
         }
     }
 
-    obterInfo() {
-        return `${this.marca} ${this.modelo}, Ano: ${this.ano}, Quilometragem: ${this.kilometragem} km`;
-    }
+    obterInfo() {}
 }
 
killedBy: Testes da classe Carro Deve retornar as informações corretas do carro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Toyota Corolla, Ano: 2020, Quilometragem: 0 km"
Received: undefined
