[Killed] BlockStatement
src/cnh.js:1:29
-const obterCnh = (idade) => {
-  return idade >= 18;
-};
+const obterCnh = (idade) => {};
 
 module.exports = {
killedBy: Validando CNH com idade 21 anos
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] EqualityOperator
src/cnh.js:2:10
 const obterCnh = (idade) => {
-  return idade >= 18;
+  return idade < 18;
 };
 
killedBy: Validando CNH com idade 21 anos
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/cnh.js:2:10
 const obterCnh = (idade) => {
-  return idade >= 18;
+  return true;
 };
 
killedBy: Validando CNH com idade 17 anos
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ObjectLiteral
src/cnh.js:5:18
   return idade >= 18;
 };
 
-module.exports = {
-  obterCnh,
-};
+module.exports = {};
 
killedBy: Validando CNH com idade 21 anos
statusReason: TypeError: obterCnh is not a function
