[Killed] BlockStatement
src/lista.js:2:19
 class ListaDeCompras {
-    constructor() {
-        this.itens = [];
-    }
+    constructor() {}
 
     adicionarItem(item) {
killedBy: Testes da classe ListaDeCompras Deve adicionar itens corretamente à lista
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
src/lista.js:3:22
 class ListaDeCompras {
     constructor() {
-        this.itens = [];
+        this.itens = ["Stryker was here"];
     }
 
killedBy: Testes da classe ListaDeCompras Deve adicionar itens corretamente à lista
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "Stryker was here",
    "Leite",

[Killed] BlockStatement
src/lista.js:6:25
         this.itens = [];
     }
 
-    adicionarItem(item) {
-        this.itens.push(item);
-    }
+    adicionarItem(item) {}
 
     removerItem(item) {
killedBy: Testes da classe ListaDeCompras Deve adicionar itens corretamente à lista
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "Leite",
-   "Pão",

[Killed] BlockStatement
src/lista.js:10:23
         this.itens.push(item);
     }
 
-    removerItem(item) {
-        const index = this.itens.indexOf(item);
-        if (index === -1) {
-            throw new Error("Item não encontrado na lista");
-        }
-        this.itens.splice(index, 1);
-    }
+    removerItem(item) {}
 
     obterItens() {
killedBy: Testes da classe ListaDeCompras Deve remover um item existente da lista
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "Leite",
    "Pão",

[Killed] ConditionalExpression
src/lista.js:12:13
 
     removerItem(item) {
         const index = this.itens.indexOf(item);
-        if (index === -1) {
+        if (true) {
             throw new Error("Item não encontrado na lista");
         }
killedBy: Testes da classe ListaDeCompras Deve remover um item existente da lista
statusReason: Error: Item não encontrado na lista

[Killed] UnaryOperator
src/lista.js:12:23
 
     removerItem(item) {
         const index = this.itens.indexOf(item);
-        if (index === -1) {
+        if (index === +1) {
             throw new Error("Item não encontrado na lista");
         }
killedBy: Testes da classe ListaDeCompras Deve lançar um erro ao tentar remover um item que não existe na lista
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Item não encontrado na lista"

Received function did not throw

[Killed] StringLiteral
src/lista.js:13:29
     removerItem(item) {
         const index = this.itens.indexOf(item);
         if (index === -1) {
-            throw new Error("Item não encontrado na lista");
+            throw new Error("");
         }
         this.itens.splice(index, 1);
killedBy: Testes da classe ListaDeCompras Deve lançar um erro ao tentar remover um item que não existe na lista
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Item não encontrado na lista"
Received message:   ""

      74 |         } else {
      75 |           stryCov_9fa48("251");
    > 76 |           throw new Error(stryMutAct_9fa48("252") ? "" : (stryCov_9fa48("252"), "Item não encontrado na lista"));

[Killed] BlockStatement
src/lista.js:18:18
         this.itens.splice(index, 1);
     }
 
-    obterItens() {
-        return this.itens;
-    }
+    obterItens() {}
 }
 
killedBy: Testes da classe ListaDeCompras Deve adicionar itens corretamente à lista
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["Leite", "Pão"]
Received: undefined
