[Killed] BlockStatement
src/pessoa.js:2:30
 class Pessoa {
-    constructor(nome, idade) {
-        this.nome = nome;
-        this.idade = idade;
-    }
+    constructor(nome, idade) {}
 
     apresentar() {
killedBy: Testes da classe Pessoa Deve criar uma pessoa com o nome e idade corretos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Maria"
Received: undefined

[Killed] BlockStatement
src/pessoa.js:7:18
         this.idade = idade;
     }
 
-    apresentar() {
-        return `Olá, meu nome é ${this.nome} e eu tenho ${this.idade} anos.`;
-    }
+    apresentar() {}
 
     atualizarIdade(novaIdade) {
killedBy: Testes da classe Pessoa Deve apresentar a pessoa corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Olá, meu nome é Maria e eu tenho 30 anos."
Received: undefined

[Killed] BlockStatement
src/pessoa.js:11:31
         return `Olá, meu nome é ${this.nome} e eu tenho ${this.idade} anos.`;
     }
 
-    atualizarIdade(novaIdade) {
-        this.idade = novaIdade;
-    }
+    atualizarIdade(novaIdade) {}
 }
 
killedBy: Testes da classe Pessoa Deve atualizar a idade da pessoa corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 31
Received: 30
